Contributing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Contributing</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-16 23:59:26 EDT"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Guidelines for contributing to the Pallet project."/>
<meta name="keywords" content="pallet palletops contribute"/>
<link rel="stylesheet" type="text/css" href="doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<h1 class="title">Contributing</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Tests </h2>
<div class="outline-text-2" id="text-1">


<p>
Please make sure tests pass, and test cases are added to cover new code.
</p>
<p>
To run the pallet tests, you will need to authorise your id<sub>rsa</sub> key on localhost.
</p>
<p>
To run pallet-crates live-test, you can use the `live-test` profile:
</p>
<p>
mvn clojure:test -P live-test -Dpallet.test.service-name=ec2
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Source Code Format </h2>
<div class="outline-text-2" id="text-2">


<p>
Source code should follow the following rules:
</p><ul>
<li>
No Tabs
</li>
<li>
80 character maximum line length
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Commit messages </h2>
<div class="outline-text-2" id="text-3">


<p>
Commit messages are used to generate the changelog (see below).
</p>
<p>
your messages should start with a single line that’s no more than about 50
characters and that describes the changeset concisely, followed by a blank line,
followed by a more detailed explanation.
</p>
<p>
See <a href="http://progit.org/book/ch5-2.html#commit_guidelines">http://progit.org/book/ch5-2.html#commit_guidelines</a> for a more complete
explaination of commit messages.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Changelog </h2>
<div class="outline-text-2" id="text-4">

<p>The <a href="#changelog">ChangeLog</a> is maintained in the wiki, and is built using commit messages.
</p>
<p>
The changelog format is produced directly by git, just add the following to your
`.gitconfig` file:
</p>
<p>
[pretty]
changelog = format:- %w(76,0,2)%s%n%w(76,2,2)%b
</p>
<p>
To generate the raw input for the changelog, then run the following, replacing
`pallet-0.4.0` with a commit or tag that you want to start from:
</p>
<p>
git log &ndash;pretty=changelog  pallet-0.4.0..
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-06-16 23:59:26 EDT</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
